*** Array Creation
    1. create an array from a reqular Python list or tuple using *np.array* function.
      #+begin_src ipython
        import numpy as np

        a = np.array([[1, 2, 3], [4, 5, 6]], dtype=np.int16)
        print(a)
        print('dtpye:', a.dtype)

       #+end_src
    
    2. NumPy offers serval functions to create arrays with inital placeholder content.
       #+begin_src ipython
         import numpy as np

         print(np.zeros((3, 4)))
         print(np.ones((2, 3, 4), dtype=np.int16))
         print(np.empty((2, 3)))


         print(np.arange(10, 30, 5))
         print(np.linspace(0, 2, 9))
       #+end_src

       #+RESULTS:
       : # Out[5]:
       
       See also:
       array, zeros, zeros_like, ones, ones_like, empty, empty_like, arange, linspace, numpy.random.rand, numpy.random.randn, fromfunction, fromfile

*** Basic Operations
    elementwise, return a new one: +, -, *, /, **, sin, >, <, ==
    matrix, return a new one: dot
    act in place to modify an existing array: +=, *=

    When operating with arrays of different types, the type of the resulting array corresponds to the more general or precise one

    unary operations: sum, min, max
    By default, these operaions apply to the array as though it were a list of numbers, regardless of its shape. 
    However, by specifying the *axis* parameter you can apply an operation along the specified axis of an array.
    #+begin_src ipython
      import numpy as np

      b = np.arange(12).reshape(3, 4)
      print(b)
      print(b.sum(axis=0))
      print(b.sum(axis=1))
      print(b.cumsum(axis=1))

    #+end_src

    #+RESULTS:
    : # Out[6]:

    
